# Height Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsRun..::..Height Property
StairsRun Class See Also
---
The calculated height of the stairs run.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Height { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Height As Double
	Get
```

Visual C++
---
```text
public:
property double Height {
	double get ();
}
```

# Remarks
The height is the elevation span between run's base elevation and top elevation.
# See Also
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace